---
type: DirectShapeOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# DirectShapeOptions

`Autodesk.Revit.DB.DirectShapeOptions` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | ReferencingOption | 2016 | `public DirectShapeReferencingOption ReferencingOption { get ; set ; }` |
| Property | RoomBoundingOption | 2016 | `public DirectShapeRoomBoundingOption RoomBoundingOption { get ; }` |